//#define MSC_ImageSize   0x00001000
#define MSC_ImageSize   0x400

//extern const unsigned char DiskImage[MSC_ImageSize];   /* Disk Image */

//虚拟U盘从0x8003000开始,使用FAT分区后,格式化参数为
//(1)MBR区（主引导扇区）
//0x8003000: eb 3c 90 4d 53 44 4f 53 35 2e 30 00 04 01 02 00
//           0        3                       11    13 14		
//00.跳转指令
//03.MSDOS5.3
//11.每扇区字节数		=0x400=1K字节
//13.每簇占用扇区数		=1个
//14.保留扇区			=2个,FAT1开始地址=0x400*2=0x800
//0x8003010: 02 00 02 34 00 f8 01 00 01 00 01 00 00 00 00 00
//           16 17    19    21 22    24    26    28
//16.FAT表数量			=2个,
//17.最大根目录文件数	=0x200=512个
//19.逻辑扇区总数		=0x34=52个,[容量=52K]
//21.媒体描述符			=0xf8,表示硬盘
//22.每个FAT占用扇区数	=1
//24.每个磁道扇区数		=1
//26.磁头数				=1
//28.隐藏扇区数			=0
//根目录扇区位置=FAT表数量*FAT表所占用的扇区数量+隐藏扇区数量=2*1=2
//用户数据开始位置=根目录扇区位置+根目录所占用扇区=2+?
//0x8003020: 00 00 00 00 00 00 29 c8 bf 76 b4 4e 4f 20 4e 41
//           32          36 37 38 39          43
//32.如果BPB_TotSec16是0,则在这里记录扇区总数
//36.中断13的驱动器号	=0
//37.未使用
//38.扩展引导标志		=0x29
//39.卷序列号			=0xbf-76-b4-c8  
//43.卷标				=NO NAME	必须是11个字符,不足以空格填充	
//0x8003030: 4d 45 20 20 20 20 46 41 54 31 32 20 20 20 33 c9
//                             54
//54.文件系统类型		=FAT12		必须是8个字符,不足填充空格  
//62.引导代码						由偏移0字节处的短跳转而来	
//510.系统引导标识		=0xaa55h 

// （2）DBR区
// （3）FAT区
// （4）DIR区（根目录区） 
// （5）数据（DATA）区 
//BookKeep = PhysSectPerTrck + 1 + NumFATs * NumSectPerFAT + SectRootDir


